---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailHeight
source: html/e7109b77-f375-3a62-43c3-9be646fe7375.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailHeight Property

The height of the primary handrail.

## Syntax (C#)
```csharp
public double PrimaryHandrailHeight { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The rail has no primary hand rail.